app/controllers/tamagotchis_controller.rb

  def create
    tamagotchi = @user.create_tamagotchi(tamagotchi_params)
---
INSERT INTO "tamagotchis" ("bio", "created_at", "name", "rating", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["bio", ""], ["created_at", Thu, 13 Feb 2014 10:56:11 UTC +00:00], ["name", ""], ["rating", 1], ["updated_at", Thu, 13 Feb 2014 10:56:11 UTC +00:00], ["user_id", 7]]

  def update
    @tamagotchi.update_attributes(tamagotchi_params)
---
UPDATE "tamagotchis" SET "bio" = ?, "rating" = ?, "updated_at" = ? WHERE "tamagotchis"."id" = 5  [["bio", "a marvellous pety"], ["rating", 6], ["updated_at", Thu, 13 Feb 2014 10:55:30 UTC +00:00]]

  def destroy
    @tamagotchi.destroy
---
DELETE FROM "tamagotchis" WHERE "tamagotchis"."id" = ?  [["id", 11]]